# SQL in Python

In this notebook, you'll practice writing SQL code within a Python notebook using `sqlalchemy` and `pandas`.

In [2]:
from sqlalchemy import create_engine
import pandas as pd

## 1. Connect Python to a Database

Connect this notebook to the `doctors.db` database using `create_engine`

In [6]:
engine = create_engine("sqlite:///data/doctors.db")

Engine(sqlite:///data/doctors.db)

List the *table names* in the database

In [7]:
all_tables = engine.table_names()
all_tables

['doctors', 'rates']

## 2. Explore the Database

Write a SQL query using `pd.read_sql()` to show all of the data in the `doctors` table

In [8]:
doctors_data = pd.read_sql('SELECT * FROM doctors;', engine)
doctors_data

     Name        Day  Location    Details
0  Arthur     Monday   Chicago  Check ups
1  Arthur     Sunday   Chicago    On call
2    Dora     Monday  Evanston    Surgery
3    Dora  Wednesday  Evanston    Surgery
4    Dora     Sunday   Chicago    On call

Check the data type of `doctors_data`.

## 3. Recap

Let's pause for a moment and appreciate the magic of `sqlalchemy`.
* We were able to connect to a database from a Python notebook
* The connection was saved as a Python object and we could run Python methods (`.table_names()`) on a SQL database.
* We wrote SQL code within a Python environment.
* The output of the SQL code was a `pandas` dataframe

## 4. SQL Practice

Write a SQL query using `pd.read_sql()` to show all of the data in the `rates` table

In [1]:
# YOUR CODE HERE

Write a SQL query using `pd.read_sql()` to join the `doctors` and `rates` tables

In [11]:
# YOUR CODE HERE

     Name        Day  Location    Details        Day  Location Rate
0  Arthur     Monday   Chicago  Check ups     Monday   Chicago   90
1  Arthur     Sunday   Chicago    On call     Sunday   Chicago   20
2    Dora     Monday  Evanston    Surgery     Monday  Evanston  210
3    Dora  Wednesday  Evanston    Surgery  Wednesday  Evanston  210
4    Dora     Sunday   Chicago    On call     Sunday   Chicago   20